---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.BoundaryRestraintRotZ
source: html/0002e99b-f1c0-0480-514a-c3d9f466b9fd.htm
---
# Autodesk.Revit.DB.ParameterTypeId.BoundaryRestraintRotZ Property

"Z Spring Modulus"

## Syntax (C#)
```csharp
public static ForgeTypeId BoundaryRestraintRotZ { get; }
```